adamkondraciuk/nrfx/mdk/nrf54lilium_network.h
typedef struct {                                /*!< (@ 0x41008000) RADIO Structure                                            */
  __OM  uint32_t  TASKS_TXEN;                   /*!< (@ 0x00000000) Enable RADIO in TX mode                                    */
  __OM  uint32_t  TASKS_RXEN;                   /*!< (@ 0x00000004) Enable RADIO in RX mode                                    */
  __OM  uint32_t  TASKS_START;                  /*!< (@ 0x00000008) Start RADIO                                                */
  __OM  uint32_t  TASKS_STOP;                   /*!< (@ 0x0000000C) Stop RADIO                                                 */
  __OM  uint32_t  TASKS_DISABLE;                /*!< (@ 0x00000010) Disable RADIO                                              */
  __OM  uint32_t  TASKS_RSSISTART;              /*!< (@ 0x00000014) Start the RSSI and take one single sample of
                                                                    the receive signal strength                                */
  __OM  uint32_t  TASKS_BCSTART;                /*!< (@ 0x00000018) Start the bit counter                                      */
  __OM  uint32_t  TASKS_BCSTOP;                 /*!< (@ 0x0000001C) Stop the bit counter                                       */
  __OM  uint32_t  TASKS_EDSTART;                /*!< (@ 0x00000020) Start the energy detect measurement used in IEEE
                                                                    802.15.4 mode                                              */
  __OM  uint32_t  TASKS_EDSTOP;                 /*!< (@ 0x00000024) Stop the energy detect measurement                         */
  __OM  uint32_t  TASKS_CCASTART;               /*!< (@ 0x00000028) Start the clear channel assessment used in IEEE
                                                                    802.15.4 mode                                              */
  __OM  uint32_t  TASKS_CCASTOP;                /*!< (@ 0x0000002C) Stop the clear channel assessment                          */
  __OM  uint32_t  TASKS_DFESTART;               /*!< (@ 0x00000030) Start DFE operation                                        */
  __OM  uint32_t  TASKS_DFESTOP;                /*!< (@ 0x00000034) Stop DFE operation                                         */
  __OM  uint32_t  TASKS_ACQINJ0DMASTART;        /*!< (@ 0x00000038) Start DMA transaction                                      */
  __OM  uint32_t  TASKS_ACQINJ0DMASTOP;         /*!< (@ 0x0000003C) Stop ongoing DMA transaction                               */
  __OM  uint32_t  TASKS_ACQINJ1DMASTART;        /*!< (@ 0x00000040) Start DMA transaction                                      */
  __OM  uint32_t  TASKS_ACQINJ1DMASTOP;         /*!< (@ 0x00000044) Stop ongoing DMA transaction                               */
  __OM  uint32_t  TASKS_CNTPSTART;              /*!< (@ 0x00000048) Start packet counter                                       */
  __OM  uint32_t  TASKS_CNTPSTOP;               /*!< (@ 0x0000004C) Stop packet counter                                        */
  __OM  uint32_t  TASKS_CNTPCLEAR;              /*!< (@ 0x00000050) Clear packet counter                                       */
  __OM  uint32_t  TASKS_LOOPBACKEN;             /*!< (@ 0x00000054) Enable RADIO in LOOPBACK mode                              */
  __OM  uint32_t  TASKS_CALSTART;               /*!< (@ 0x00000058) Start calibration                                          */
  __OM  uint32_t  TASKS_CALSTOP;                /*!< (@ 0x0000005C) Stop calibration                                           */
  __OM  uint32_t  TASKS_PATESTSTART;            /*!< (@ 0x00000060) Start PA test                                              */
  __OM  uint32_t  TASKS_PATESTSTOP;             /*!< (@ 0x00000064) Stop PA test                                               */
  __OM  uint32_t  TASKS_CHNOINCR;               /*!< (@ 0x00000068) Update RADIO channel based on the current channel
                                                                    and increment it according to chNoIncrStep                 */
  __OM  uint32_t  TASKS_DMASTART;               /*!< (@ 0x0000006C) Start RADIO DMA transaction                                */
  __OM  uint32_t  TASKS_DMASTOP;                /*!< (@ 0x00000070) Stop ongoing RADIO DMA transaction                         */
  __OM  uint32_t  TASKS_DFEDMASTART;            /*!< (@ 0x00000074) Start DFE DMA transaction                                  */
  __OM  uint32_t  TASKS_DFEDMASTOP;             /*!< (@ 0x00000078) Stop ongoing DFE DMA transaction                           */
  __OM  uint32_t  TASKS_RESERVED_31;            /*!< (@ 0x0000007C) UNUSED_31                                                  */
  __OM  uint32_t  TASKS_GETNEXTDETECT;          /*!< (@ 0x00000080) Pull the last item out of the detect FIFO                  */
  __OM  uint32_t  TASKS_CLEARDETECTFIFO;        /*!< (@ 0x00000084) Clear the detect FIFO                                      */
  __OM  uint32_t  TASKS_RESETDEMODCTRL;         /*!< (@ 0x00000088) Sets all things back to original state in RxDemodCtrl      */
  __OM  uint32_t  TASKS_DEMODCTRLSTARTTIMER;    /*!< (@ 0x0000008C) Start the built-in custom timer. When starting
                                                                    the timer, it always starts from 0                         */
  __OM  uint32_t  TASKS_DEMODCTRLSTOPTIMER;     /*!< (@ 0x00000090) Stop the built-in custom timer. When stopping
                                                                    the timer, it is always cleared afterwards                 */
  __OM  uint32_t  TASKS_DEMODCTRLCONDEN0;       /*!< (@ 0x00000094) Enable condition 0. After this task has been
                                                                    triggered, the condition will trigger exactly
                                                                    once                                                       */
  __OM  uint32_t  TASKS_DEMODCTRLCONDEN1;       /*!< (@ 0x00000098) Enable condition 1. After this task has been
                                                                    triggered, the condition will trigger exactly
                                                                    once                                                       */
  __OM  uint32_t  TASKS_DEMODCTRLCONDEN2;       /*!< (@ 0x0000009C) Enable condition 2. After this task has been
                                                                    triggered, the condition will trigger exactly
                                                                    once                                                       */
  __IM  uint32_t  RESERVED[24];
  __IOM uint32_t  EVENTS_READY;                 /*!< (@ 0x00000100) RADIO has ramped up and is ready to be started             */
  __IOM uint32_t  EVENTS_TXREADY;               /*!< (@ 0x00000104) RADIO has ramped up and is ready to be started
                                                                    TX path                                                    */
  __IOM uint32_t  EVENTS_RXREADY;               /*!< (@ 0x00000108) RADIO has ramped up and is ready to be started
                                                                    RX path                                                    */
  __IOM uint32_t  EVENTS_ADDRESS;               /*!< (@ 0x0000010C) Address sent or received                                   */
  __IOM uint32_t  EVENTS_FRAMESTART;            /*!< (@ 0x00000110) IEEE 802.15.4 length field received                        */
  __IOM uint32_t  EVENTS_PAYLOAD;               /*!< (@ 0x00000114) Packet payload sent or received                            */
  __IOM uint32_t  EVENTS_END;                   /*!< (@ 0x00000118) Packet sent or received                                    */
  __IOM uint32_t  EVENTS_PHYEND;                /*!< (@ 0x0000011C) The last bit is sent on air or last bit is received        */
  __IOM uint32_t  EVENTS_DISABLED;              /*!< (@ 0x00000120) RADIO has been disabled                                    */
  __IOM uint32_t  EVENTS_DEVMATCH;              /*!< (@ 0x00000124) A device address match occurred on the last received
                                                                    packet                                                     */
  __IOM uint32_t  EVENTS_DEVMISS;               /*!< (@ 0x00000128) No device address match occurred on the last
                                                                    received packet                                            */
  __IOM uint32_t  EVENTS_CRCOK;                 /*!< (@ 0x0000012C) Packet received with CRC ok                                */
  __IOM uint32_t  EVENTS_CRCERROR;              /*!< (@ 0x00000130) Packet received with CRC error                             */
  __IOM uint32_t  EVENTS_RESERVED_13;           /*!< (@ 0x00000134) UNUSED_13                                                  */
  __IOM uint32_t  EVENTS_BCMATCH;               /*!< (@ 0x00000138) Bit counter reached bit count value                        */
  __IOM uint32_t  EVENTS_EDEND;                 /*!< (@ 0x0000013C) Sampling of energy detection complete. A new
                                                                    ED sample is ready for readout from the
                                                                    RADIO.EDSAMPLE register.                                   */
  __IOM uint32_t  EVENTS_EDSTOPPED;             /*!< (@ 0x00000140) The sampling of energy detection has stopped               */
  __IOM uint32_t  EVENTS_CCAIDLE;               /*!< (@ 0x00000144) Wireless medium in idle - clear to send                    */
  __IOM uint32_t  EVENTS_CCABUSY;               /*!< (@ 0x00000148) Wireless medium busy - do not send                         */
  __IOM uint32_t  EVENTS_CCASTOPPED;            /*!< (@ 0x0000014C) The CCA has stopped                                        */
  __IOM uint32_t  EVENTS_RATEBOOST;             /*!< (@ 0x00000150) Ble_LR CI field received, receive mode is changed
                                                                    from Ble_LR125Kbit to Ble_LR500Kbit                        */
  __IOM uint32_t  EVENTS_MHRMATCH;              /*!< (@ 0x00000154) MAC header match found                                     */
  __IOM uint32_t  EVENTS_SYNC;                  /*!< (@ 0x00000158) Initial sync detected                                      */
  __IOM uint32_t  EVENTS_CTEPRESENT;            /*!< (@ 0x0000015C) CTEInfo byte is received                                   */
  __IOM uint32_t  EVENTS_CTEWARNING;            /*!< (@ 0x00000160) CTEInfo byte received, but contain illegal CTETime
                                                                    or CTEType.                                                */
  __IOM uint32_t  EVENTS_DFEEND;                /*!< (@ 0x00000164) DFE operation has ended                                    */
  __IOM uint32_t  EVENTS_MODEWRITTEN;           /*!< (@ 0x00000168) Generated on write access to MODE register                 */
  __IOM uint32_t  EVENTS_MODEREADY;             /*!< (@ 0x0000016C) Generated immediately on write access to MODE
                                                                    register when MODEPROGENABLE==0, otherwise
                                                                    only manually triggered (SELECT_EVENTS_TRIGGERS=1)         */
  __IOM uint32_t  EVENTS_CTEEND;                /*!< (@ 0x00000170) CTE end                                                    */
  __IOM uint32_t  EVENTS_LBREADY;               /*!< (@ 0x00000174) RADIO is ready in loopback mode and is able to
                                                                    transmit and receive data                                  */
  __IOM uint32_t  EVENTS_CALDONE;               /*!< (@ 0x00000178) RADIO calibration is done                                  */
  __IOM uint32_t  EVENTS_CHNOUPDATED;           /*!< (@ 0x0000017C) RADIO channel no. is updated                               */
  __IOM uint32_t  EVENTS_DBCTIMEOUT;            /*!< (@ 0x00000180) DBC timeout to be able to resync                           */
  __IOM uint32_t  EVENTS_TXTIMERMATCH;          /*!< (@ 0x00000184) Tx timer match                                             */
  __IOM uint32_t  EVENTS_RXTIMERMATCH;          /*!< (@ 0x00000188) Rx timer match                                             */
  __IOM uint32_t  EVENTS_RESERVED_35;           /*!< (@ 0x0000018C) UNUSED_35                                                  */
  __IOM uint32_t  EVENTS_RXDIGEN;               /*!< (@ 0x00000190) RXDIGEN was set high from the HW timing engine             */
  __IOM uint32_t  EVENTS_RAWDETECT;             /*!< (@ 0x00000194) The double correlator detected one peak                    */
  __IOM uint32_t  EVENTS_DETECTFIFOFULL;        /*!< (@ 0x00000198) The detect FIFO is full. This should not happen
                                                                    if the FIFO is sized well enough                           */
  __IOM uint32_t  EVENTS_TIMERWRAPS;            /*!< (@ 0x0000019C) Event triggering when the timer wraps around.
                                                                    This is useful if one wants to count longer
                                                                    than the HW timer allows                                   */
  __IOM uint32_t  EVENTS_STROBETIMETRACKUPDATED;/*!< (@ 0x000001A0) New information from the symbol time tracker.
                                                                    See STROBETIMESTATUS                                       */
  __IOM uint32_t  EVENTS_DEMODCTRLCONDTRIGGERED0;/*!< (@ 0x000001A4) Condition 0 triggered and actions done                    */
  __IOM uint32_t  EVENTS_DEMODCTRLCONDTRIGGERED1;/*!< (@ 0x000001A8) Condition 1 triggered and actions done                    */
  __IOM uint32_t  EVENTS_DEMODCTRLCONDTRIGGERED2;/*!< (@ 0x000001AC) Condition 2 triggered and actions done                    */
  __IOM uint32_t  EVENTS_RESERVED_44;           /*!< (@ 0x000001B0) UNUSED_44                                                  */
  __IOM uint32_t  EVENTS_RESERVED_45;           /*!< (@ 0x000001B4) UNUSED_45                                                  */
  __IOM uint32_t  EVENTS_RESERVED_46;           /*!< (@ 0x000001B8) UNUSED_46                                                  */
  __IOM uint32_t  EVENTS_RESERVED_47;           /*!< (@ 0x000001BC) UNUSED_47                                                  */
  __IOM uint32_t  EVENTS_ACQINJ0DMAEND;         /*!< (@ 0x000001C0) ACQ DMA end                                                */
  __IOM uint32_t  EVENTS_ACQINJ1DMAEND;         /*!< (@ 0x000001C4) INJ DMA end                                                */
  __IM  uint32_t  RESERVED1[14];
  __IOM uint32_t  SHORTS;                       /*!< (@ 0x00000200) Shortcuts between local events and tasks                   */
  __IM  uint32_t  RESERVED2[63];
  __IOM uint32_t  INTEN00;                      /*!< (@ 0x00000300) Enable or disable interrupt                                */
  __IOM uint32_t  INTEN01;                      /*!< (@ 0x00000304) Enable or disable interrupt                                */
  __IOM uint32_t  INTENSET00;                   /*!< (@ 0x00000308) Enable interrupt                                           */
  __IOM uint32_t  INTENSET01;                   /*!< (@ 0x0000030C) Enable interrupt                                           */
  __IOM uint32_t  INTENCLR00;                   /*!< (@ 0x00000310) Disable interrupt                                          */
  __IOM uint32_t  INTENCLR01;                   /*!< (@ 0x00000314) Disable interrupt                                          */
  __IM  uint32_t  INTPEND00;                    /*!< (@ 0x00000318) Pending interrupts                                         */
  __IM  uint32_t  INTPEND01;                    /*!< (@ 0x0000031C) Pending interrupts                                         */
  __IOM uint32_t  INTEN10;                      /*!< (@ 0x00000320) Enable or disable interrupt                                */
  __IOM uint32_t  INTEN11;                      /*!< (@ 0x00000324) Enable or disable interrupt                                */
  __IOM uint32_t  INTENSET10;                   /*!< (@ 0x00000328) Enable interrupt                                           */
  __IOM uint32_t  INTENSET11;                   /*!< (@ 0x0000032C) Enable interrupt                                           */
  __IOM uint32_t  INTENCLR10;                   /*!< (@ 0x00000330) Disable interrupt                                          */
  __IOM uint32_t  INTENCLR11;                   /*!< (@ 0x00000334) Disable interrupt                                          */
  __IM  uint32_t  INTPEND10;                    /*!< (@ 0x00000338) Pending interrupts                                         */
  __IM  uint32_t  INTPEND11;                    /*!< (@ 0x0000033C) Pending interrupts                                         */
  __IM  uint32_t  RESERVED3[48];
  __IOM uint32_t  MODE;                         /*!< (@ 0x00000400) Data rate and modulation                                   */
  __IOM uint32_t  MODEINTERNAL;                 /*!< (@ 0x00000404) Internal mode setting, active only when MODEPROGENABLE==1  */
  __IOM uint32_t  MODEPROGENABLE;               /*!< (@ 0x00000408) Switch that enables programmable modes                     */
  __IOM uint32_t  MODE_DEPENDENT_XPB_TEST_REGISTER;/*!< (@ 0x0000040C) Mode dependent XPB test register                        */
  __IOM uint32_t  MODECNF;                      /*!< (@ 0x00000410) Radio mode configuration register                          */
  __IOM uint32_t  MISC;                         /*!< (@ 0x00000414) Misc configuration collection (to be renamed
                                                                    when more bits are defined)                                */
  __IM  uint32_t  RESERVED4[2];
  __IM  uint32_t  STATE;                        /*!< (@ 0x00000420) Current radio state                                        */
  __IM  uint32_t  RESERVED5[3];
  __IOM uint32_t  EDCTRL;                       /*!< (@ 0x00000430) IEEE 802.15.4 energy detect control                        */
  __IM  uint32_t  EDSAMPLE;                     /*!< (@ 0x00000434) IEEE 802.15.4 energy detect level                          */
  __IOM uint32_t  CCACTRL;                      /*!< (@ 0x00000438) IEEE 802.15.4 clear channel assessment control             */
  __IM  uint32_t  RESERVED6;
  __IOM uint32_t  DATAWHITEIV;                  /*!< (@ 0x00000440) Data whitening initial value                               */
  __IM  uint32_t  RESERVED7;
  __IOM uint32_t  ACQINJCNF0;                   /*!< (@ 0x00000448) Data acquisition capture mode                              */
  __IOM uint32_t  ACQINJCNF1;                   /*!< (@ 0x0000044C) Data acquisition capture mode                              */
  __IOM uint32_t  ACQINJDMA0_ENABLE;            /*!< (@ 0x00000450) Enable or disable data acquisition                         */
  __IOM uint32_t  ACQINJDMA0_PTR;               /*!< (@ 0x00000454) ACQ DMA pointer                                            */
  __IOM uint32_t  ACQINJDMA0_MAXCNT;            /*!< (@ 0x00000458) Maximum number of 32-bit words to transfer                 */
  __IM  uint32_t  ACQINJDMA0_AMOUNT;            /*!< (@ 0x0000045C) Number of 32-bit words transferred in the last
                                                                    transaction                                                */
  __IOM uint32_t  ACQINJDMA1_ENABLE;            /*!< (@ 0x00000460) Enable or disable data store                               */
  __IOM uint32_t  ACQINJDMA1_PTR;               /*!< (@ 0x00000464) ACQ DMA pointer                                            */
  __IOM uint32_t  ACQINJDMA1_MAXCNT;            /*!< (@ 0x00000468) Maximum number of 32-bit words to transfer                 */
  __IM  uint32_t  ACQINJDMA1_AMOUNT;            /*!< (@ 0x0000046C) Number of 32-bit words transferred in the last
                                                                    transaction                                                */
  __IM  uint32_t  RESERVED8[6];
  __IOM RADIO_DEBUGPSEL_Type DEBUGPSEL;         /*!< (@ 0x00000488) Unspecified                                                */
  __IOM RADIO_EXTPSEL_Type EXTPSEL;             /*!< (@ 0x00000490) Unspecified                                                */
  __IM  uint32_t  RESERVED9[2];
  __IM  uint32_t  GAIN_OUT;                     /*!< (@ 0x000004A0) Gain readout (LNA_OUT_SPI for nrf52/53)                    */
  __IM  uint32_t  RESERVED10[23];
  __IOM uint32_t  SHORTCUT_INTERNAL;            /*!< (@ 0x00000500) TODO                                                       */
  __IOM uint32_t  MODE_STAND_ALONE;             /*!< (@ 0x00000504) TODO                                                       */
  __IM  uint32_t  FREQUENCY;                    /*!< (@ 0x00000508) Frequency                                                  */
  __IOM uint32_t  FREQUENCY_CONFIG;             /*!< (@ 0x0000050C) TODO                                                       */
  __IOM uint32_t  TXPOWER;                      /*!< (@ 0x00000510) Output power                                               */
  __IOM uint32_t  TIFS;                         /*!< (@ 0x00000514) Interframe spacing in us                                   */
  __IM  uint32_t  RESERVED11;
  __IOM uint32_t  SPHYNXSUPPORTEVENTS;          /*!< (@ 0x0000051C) TODO                                                       */
  __IOM uint32_t  CALIBRATION_TARGET;           /*!< (@ 0x00000520) TODO                                                       */
  __IOM uint32_t  CALIBRATION_CONFIG;           /*!< (@ 0x00000524) TODO                                                       */
  __IM  uint32_t  CALIBRATION_RESULT;           /*!< (@ 0x00000528) TODO                                                       */
  __IM  uint32_t  RESERVED12;
  __IOM uint32_t  SPHYNXANA_TEST;               /*!< (@ 0x00000530) TODO                                                       */
  __IOM uint32_t  SPHYNXANA_FS_CTRL_0;          /*!< (@ 0x00000534) TODO                                                       */
  __IOM uint32_t  SPHYNXANA_FS_CTRL_1;          /*!< (@ 0x00000538) TODO                                                       */
  __IOM uint32_t  SPHYNXANA_FS_CTRL_2;          /*!< (@ 0x0000053C) TODO                                                       */
  __IOM uint32_t  SPHYNXANA_RX_CTRL;            /*!< (@ 0x00000540) TODO                                                       */
  __IOM uint32_t  SPHYNXANA_TX_CTRL;            /*!< (@ 0x00000544) TODO                                                       */
  __IOM uint32_t  SPHYNXANA_MODE_DEPENDENT;     /*!< (@ 0x00000548) TODO                                                       */
  __IOM uint32_t  SPHYNXANA_RX_TRIM_CODE;       /*!< (@ 0x0000054C) TODO                                                       */
  __IM  uint32_t  SPHYNXANA_STATUS;             /*!< (@ 0x00000550) TODO                                                       */
  __IM  uint32_t  RESERVED13[7];
  __IOM uint32_t  TIMINGENGINE_GROUP_ALL_0;     /*!< (@ 0x00000570) TODO                                                       */
  __IOM uint32_t  TIMINGENGINE_GROUP_ALL_1;     /*!< (@ 0x00000574) TODO                                                       */
  __IOM uint32_t  TIMINGENGINE_GROUP_ALL_2;     /*!< (@ 0x00000578) TODO                                                       */
