adamkondraciuk/nrfx/mdk/nrf54lilium_network.h
  __IOM uint32_t  TIMINGENGINE_GROUP_ALL_3;     /*!< (@ 0x0000057C) TODO                                                       */
  __IOM uint32_t  TIMINGENGINE_GROUP_ALL_4;     /*!< (@ 0x00000580) TODO                                                       */
  __IOM uint32_t  TIMINGENGINE_GROUP_ALL_5;     /*!< (@ 0x00000584) TODO                                                       */
  __IOM uint32_t  TIMINGENGINE_GROUP_ALL_6;     /*!< (@ 0x00000588) TODO                                                       */
  __IOM uint32_t  TIMINGENGINE_GROUP_ALL_7;     /*!< (@ 0x0000058C) TODO                                                       */
  __IOM uint32_t  TIMINGENGINE_GROUP_ALL_8;     /*!< (@ 0x00000590) TODO                                                       */
  __IOM uint32_t  TIMINGENGINE_MODE_DEPENDENT;  /*!< (@ 0x00000594) TODO                                                       */
  __IOM uint32_t  TIMINGENGINE_GROUP_RX_0;      /*!< (@ 0x00000598) TODO                                                       */
  __IOM uint32_t  TIMINGENGINE_GROUP_RX_1;      /*!< (@ 0x0000059C) TODO                                                       */
  __IOM uint32_t  TIMINGENGINE_GROUP_RX_2;      /*!< (@ 0x000005A0) TODO                                                       */
  __IOM uint32_t  TIMINGENGINE_GROUP_RX_3;      /*!< (@ 0x000005A4) TODO                                                       */
  __IOM uint32_t  TIMINGENGINE_GROUP_RX_4;      /*!< (@ 0x000005A8) TODO                                                       */
  __IOM uint32_t  TIMINGENGINE_GROUP_TX_0;      /*!< (@ 0x000005AC) TODO                                                       */
  __IOM uint32_t  TIMINGENGINE_GROUP_TX_1;      /*!< (@ 0x000005B0) TODO                                                       */
  __IOM uint32_t  TIMINGENGINE_GROUP_TX_2;      /*!< (@ 0x000005B4) TODO                                                       */
  __IOM uint32_t  TIMINGENGINE_CONFIG;          /*!< (@ 0x000005B8) TODO                                                       */
  __IOM uint32_t  TIMINGENGINE_OVR_EN_GROUP_ALL;/*!< (@ 0x000005BC) TODO                                                       */
  __IOM uint32_t  TIMINGENGINE_OVR_EN_GROUP_RXTX;/*!< (@ 0x000005C0) TODO                                                      */
  __IOM uint32_t  TIMINGENGINE_OVR_VAL_GROUP_ALL;/*!< (@ 0x000005C4) TODO                                                      */
  __IOM uint32_t  TIMINGENGINE_OVR_VAL_GROUP_RXTX;/*!< (@ 0x000005C8) TODO                                                     */
  __IOM uint32_t  TIMINGENGINE_MODE_DEPENDENT_2;/*!< (@ 0x000005CC) TODO                                                       */
  __IOM uint32_t  RXAGC_GAIN;                   /*!< (@ 0x000005D0) TODO                                                       */
  __IOM uint32_t  RXAGC_CONFIG;                 /*!< (@ 0x000005D4) TODO                                                       */
  __IOM uint32_t  RXAGC_RSSI;                   /*!< (@ 0x000005D8) TODO                                                       */
  __IM  uint32_t  RXAGC_STATUS;                 /*!< (@ 0x000005DC) TODO                                                       */
  __IOM uint32_t  RXSATURATIONDETECT;           /*!< (@ 0x000005E0) TODO                                                       */
  __IOM uint32_t  RXPEAKDETECTOR_IF;            /*!< (@ 0x000005E4) TODO                                                       */
  __IOM uint32_t  BITCONVERTER;                 /*!< (@ 0x000005E8) TODO                                                       */
  __IM  uint32_t  RESERVED14;
  __IOM uint32_t  DATAACQVIADMA;                /*!< (@ 0x000005F0) TODO                                                       */
  __IM  uint32_t  RESERVED15[2];
  __IOM uint32_t  DEBUGRADIOPHY;                /*!< (@ 0x000005FC) TODO                                                       */
  __IOM uint32_t  MODECONF;                     /*!< (@ 0x00000600) IQCal status                                               */
  __IM  uint32_t  FESTATUS;                     /*!< (@ 0x00000604) Frontend readout register                                  */
  __IOM uint32_t  FECONFIG;                     /*!< (@ 0x00000608) Config for Mixer and Scaler                                */
  __IOM uint32_t  IQCALCONF;                    /*!< (@ 0x0000060C) Gain and phase mismatch calibration control for
                                                                    I and Q                                                    */
  __IOM uint32_t  LOGMAG;                       /*!< (@ 0x00000610) IQCal status                                               */
  __IOM uint32_t  BBPKDETCONF;                  /*!< (@ 0x00000614) Configuration for baseband peak detector                   */
  __IOM uint32_t  OUTMAIN_CKSEL_DECFIR;         /*!< (@ 0x00000618) Clock select register for the output outMain               */
  __IOM uint32_t  DECFIR0_CKSEL;                /*!< (@ 0x0000061C) Clock select register for the PUnit decFIR0 of
                                                                    type IP_FIR                                                */
  __IOM uint32_t  DECFIR0_CONTROL;              /*!< (@ 0x00000620) Control register for the PUnit decFIR0 of type
                                                                    IP_FIR                                                     */
  __IOM uint32_t  DECFIR0_COEFFS_0;             /*!< (@ 0x00000624) Coefficient register 0 for the PUnit decFIR0
                                                                    of type IP_FIR                                             */
  __IOM uint32_t  DECFIR0_COEFFS_1;             /*!< (@ 0x00000628) Coefficient register 1 for the PUnit decFIR0
                                                                    of type IP_FIR                                             */
  __IOM uint32_t  DECFIR0_COEFFS_2;             /*!< (@ 0x0000062C) Coefficient register 2 for the PUnit decFIR0
                                                                    of type IP_FIR                                             */
  __IOM uint32_t  DECFIR0_COEFFS_3;             /*!< (@ 0x00000630) Coefficient register 3 for the PUnit decFIR0
                                                                    of type IP_FIR                                             */
  __IOM uint32_t  DECFIR1_CKSEL;                /*!< (@ 0x00000634) Clock select register for the PUnit decFIR1 of
                                                                    type IP_FIR                                                */
  __IOM uint32_t  DECFIR1_CONTROL;              /*!< (@ 0x00000638) Control register for the PUnit decFIR1 of type
                                                                    IP_FIR                                                     */
  __IOM uint32_t  DECFIR1_COEFFS_0;             /*!< (@ 0x0000063C) Coefficient register 0 for the PUnit decFIR1
                                                                    of type IP_FIR                                             */
  __IOM uint32_t  DECFIR1_COEFFS_1;             /*!< (@ 0x00000640) Coefficient register 1 for the PUnit decFIR1
                                                                    of type IP_FIR                                             */
  __IOM uint32_t  DECFIR1_COEFFS_2;             /*!< (@ 0x00000644) Coefficient register 2 for the PUnit decFIR1
                                                                    of type IP_FIR                                             */
  __IOM uint32_t  DECFIR1_COEFFS_3;             /*!< (@ 0x00000648) Coefficient register 3 for the PUnit decFIR1
                                                                    of type IP_FIR                                             */
  __IOM uint32_t  DECFIR1_COEFFS_4;             /*!< (@ 0x0000064C) Coefficient register 4 for the PUnit decFIR1
                                                                    of type IP_FIR                                             */
  __IOM uint32_t  DECFIR1_COEFFS_5;             /*!< (@ 0x00000650) Coefficient register 5 for the PUnit decFIR1
                                                                    of type IP_FIR                                             */
  __IOM uint32_t  DECFIR2_CKSEL;                /*!< (@ 0x00000654) Clock select register for the PUnit decFIR2 of
                                                                    type IP_FIR                                                */
  __IOM uint32_t  DECFIR2_CONTROL;              /*!< (@ 0x00000658) Control register for the PUnit decFIR2 of type
                                                                    IP_FIR                                                     */
  __IOM uint32_t  DECFIR2_COEFFS_0;             /*!< (@ 0x0000065C) Coefficient register 0 for the PUnit decFIR2
                                                                    of type IP_FIR                                             */
  __IOM uint32_t  DECFIR2_COEFFS_1;             /*!< (@ 0x00000660) Coefficient register 1 for the PUnit decFIR2
                                                                    of type IP_FIR                                             */
  __IOM uint32_t  DECFIR2_COEFFS_2;             /*!< (@ 0x00000664) Coefficient register 2 for the PUnit decFIR2
                                                                    of type IP_FIR                                             */
  __IOM uint32_t  DECFIR2_COEFFS_3;             /*!< (@ 0x00000668) Coefficient register 3 for the PUnit decFIR2
                                                                    of type IP_FIR                                             */
  __IOM uint32_t  DECFIR2_COEFFS_4;             /*!< (@ 0x0000066C) Coefficient register 4 for the PUnit decFIR2
                                                                    of type IP_FIR                                             */
  __IOM uint32_t  DECFIR2_COEFFS_5;             /*!< (@ 0x00000670) Coefficient register 5 for the PUnit decFIR2
                                                                    of type IP_FIR                                             */
  __IOM uint32_t  OUTMAIN_CKSEL_IIR;            /*!< (@ 0x00000674) Clock select register for the output outMain               */
  __IOM uint32_t  OUTMAIN_SOURCE;               /*!< (@ 0x00000678) Source select register for the output outMain              */
  __IOM uint32_t  OUTPEAKDET_CKSEL;             /*!< (@ 0x0000067C) Clock select register for the output outPeakDet            */
  __IOM uint32_t  OUTPEAKDET_SOURCE;            /*!< (@ 0x00000680) Source select register for the output outPeakDet           */
  __IOM uint32_t  IIR0_CKSEL;                   /*!< (@ 0x00000684) Clock select register for the PUnit IIR0 of type
                                                                    IP_IIR2                                                    */
  __IOM uint32_t  IIR0_STATUS;                  /*!< (@ 0x00000688) Status register for the PUnit IIR0 of type IP_IIR2         */
  __IOM uint32_t  IIR0_COEFFS_B0;               /*!< (@ 0x0000068C) Coefficient register B0 for the PUnit IIR0 of
                                                                    type IP_IIR2                                               */
  __IOM uint32_t  IIR0_COEFFS_B1;               /*!< (@ 0x00000690) Coefficient register B1 for the PUnit IIR0 of
                                                                    type IP_IIR2                                               */
  __IOM uint32_t  IIR0_COEFFS_B2;               /*!< (@ 0x00000694) Coefficient register B2 for the PUnit IIR0 of
                                                                    type IP_IIR2                                               */
  __IOM uint32_t  IIR0_COEFFS_A1;               /*!< (@ 0x00000698) Coefficient register A1 for the PUnit IIR0 of
                                                                    type IP_IIR2                                               */
  __IOM uint32_t  IIR0_COEFFS_A2;               /*!< (@ 0x0000069C) Coefficient register A2 for the PUnit IIR0 of
                                                                    type IP_IIR2                                               */
  __IOM uint32_t  IIR1_CKSEL;                   /*!< (@ 0x000006A0) Clock select register for the PUnit IIR1 of type
                                                                    IP_IIR2                                                    */
  __IOM uint32_t  IIR1_STATUS;                  /*!< (@ 0x000006A4) Status register for the PUnit IIR1 of type IP_IIR2         */
  __IOM uint32_t  IIR1_COEFFS_B0;               /*!< (@ 0x000006A8) Coefficient register B0 for the PUnit IIR1 of
                                                                    type IP_IIR2                                               */
  __IOM uint32_t  IIR1_COEFFS_B1;               /*!< (@ 0x000006AC) Coefficient register B1 for the PUnit IIR1 of
                                                                    type IP_IIR2                                               */
  __IOM uint32_t  IIR1_COEFFS_B2;               /*!< (@ 0x000006B0) Coefficient register B2 for the PUnit IIR1 of
                                                                    type IP_IIR2                                               */
  __IOM uint32_t  IIR1_COEFFS_A1;               /*!< (@ 0x000006B4) Coefficient register A1 for the PUnit IIR1 of
                                                                    type IP_IIR2                                               */
  __IOM uint32_t  IIR1_COEFFS_A2;               /*!< (@ 0x000006B8) Coefficient register A2 for the PUnit IIR1 of
                                                                    type IP_IIR2                                               */
  __IOM uint32_t  NOTCHIIR0_CKSEL;              /*!< (@ 0x000006BC) Clock select register for the PUnit notchIIR0
                                                                    of type IP_IIR2                                            */
  __IOM uint32_t  NOTCHIIR0_SOURCE;             /*!< (@ 0x000006C0) Source select register for the PUnit notchIIR0
                                                                    of type IP_IIR2                                            */
  __IOM uint32_t  NOTCHIIR0_STATUS;             /*!< (@ 0x000006C4) Status register for the PUnit notchIIR0 of type
                                                                    IP_IIR2                                                    */
  __IOM uint32_t  NOTCHIIR0_COEFFS_B0;          /*!< (@ 0x000006C8) Coefficient register B0 for the PUnit notchIIR0
                                                                    of type IP_IIR2                                            */
  __IOM uint32_t  NOTCHIIR0_COEFFS_B1;          /*!< (@ 0x000006CC) Coefficient register B1 for the PUnit notchIIR0
                                                                    of type IP_IIR2                                            */
  __IOM uint32_t  NOTCHIIR0_COEFFS_B2;          /*!< (@ 0x000006D0) Coefficient register B2 for the PUnit notchIIR0
                                                                    of type IP_IIR2                                            */
  __IOM uint32_t  NOTCHIIR0_COEFFS_A1;          /*!< (@ 0x000006D4) Coefficient register A1 for the PUnit notchIIR0
                                                                    of type IP_IIR2                                            */
  __IOM uint32_t  NOTCHIIR0_COEFFS_A2;          /*!< (@ 0x000006D8) Coefficient register A2 for the PUnit notchIIR0
                                                                    of type IP_IIR2                                            */
  __IOM uint32_t  NOTCHIIR1_CKSEL;              /*!< (@ 0x000006DC) Clock select register for the PUnit notchIIR1
                                                                    of type IP_IIR2                                            */
  __IOM uint32_t  NOTCHIIR1_STATUS;             /*!< (@ 0x000006E0) Status register for the PUnit notchIIR1 of type
                                                                    IP_IIR2                                                    */
  __IOM uint32_t  NOTCHIIR1_COEFFS_B0;          /*!< (@ 0x000006E4) Coefficient register B0 for the PUnit notchIIR1
                                                                    of type IP_IIR2                                            */
  __IOM uint32_t  NOTCHIIR1_COEFFS_B1;          /*!< (@ 0x000006E8) Coefficient register B1 for the PUnit notchIIR1
                                                                    of type IP_IIR2                                            */
  __IOM uint32_t  NOTCHIIR1_COEFFS_B2;          /*!< (@ 0x000006EC) Coefficient register B2 for the PUnit notchIIR1
                                                                    of type IP_IIR2                                            */
  __IOM uint32_t  NOTCHIIR1_COEFFS_A1;          /*!< (@ 0x000006F0) Coefficient register A1 for the PUnit notchIIR1
                                                                    of type IP_IIR2                                            */
  __IOM uint32_t  NOTCHIIR1_COEFFS_A2;          /*!< (@ 0x000006F4) Coefficient register A2 for the PUnit notchIIR1
                                                                    of type IP_IIR2                                            */
  __IOM uint32_t  DECFIR_CKSEL;                 /*!< (@ 0x000006F8) Clock select register for the PUnit decFIR of
                                                                    type IP_FIR                                                */
  __IOM uint32_t  DECFIR_SOURCE;                /*!< (@ 0x000006FC) Source select register for the PUnit decFIR of
                                                                    type IP_FIR                                                */
  __IOM uint32_t  DECFIR_CONTROL;               /*!< (@ 0x00000700) Control register for the PUnit decFIR of type
                                                                    IP_FIR                                                     */
  __IOM uint32_t  DECFIR_COEFFS_0;              /*!< (@ 0x00000704) Coefficient register 0 for the PUnit decFIR of
                                                                    type IP_FIR                                                */
  __IOM uint32_t  DECFIR_COEFFS_1;              /*!< (@ 0x00000708) Coefficient register 1 for the PUnit decFIR of
                                                                    type IP_FIR                                                */
  __IOM uint32_t  DECFIR_COEFFS_2;              /*!< (@ 0x0000070C) Coefficient register 2 for the PUnit decFIR of
                                                                    type IP_FIR                                                */
  __IOM uint32_t  DECFIR_COEFFS_3;              /*!< (@ 0x00000710) Coefficient register 3 for the PUnit decFIR of
                                                                    type IP_FIR                                                */
  __IOM uint32_t  DECFIR_COEFFS_4;              /*!< (@ 0x00000714) Coefficient register 4 for the PUnit decFIR of
                                                                    type IP_FIR                                                */
  __IOM uint32_t  DECFIR_COEFFS_5;              /*!< (@ 0x00000718) Coefficient register 5 for the PUnit decFIR of
                                                                    type IP_FIR                                                */
  __IM  uint32_t  RESERVED16[57];
  __IM  uint32_t  CFO_STAT;                     /*!< (@ 0x00000800) Carrier freq. offset estimate                              */
  __IOM uint32_t  PB_TEST;                      /*!< (@ 0x00000804) Test: PB calibration                                       */
  __IOM uint32_t  DBC_COEFFS;                   /*!< (@ 0x00000808) Test and Debug: DBC coefficients override                  */
  __IOM uint32_t  QOVERRIDE4;                   /*!< (@ 0x0000080C) Trim value override register 4 for nRF52                   */
  __IOM uint32_t  QOVERRIDE5;                   /*!< (@ 0x00000810) Trim value override register 5 for nRF52                   */
  __IOM uint32_t  QOVERRIDE6;                   /*!< (@ 0x00000814) Trim value override register 6 for nRF52                   */
  __IOM uint32_t  QOVERRIDE9;                   /*!< (@ 0x00000818) Trim value override register 9 for nRF52                   */
  __IM  uint32_t  RESERVED17[2];
  __IOM uint32_t  QOVERRIDE12;                  /*!< (@ 0x00000824) Trim value override register 12 for nRF52                  */
  __IOM uint32_t  QOVERRIDE23;                  /*!< (@ 0x00000828) Trim value override register 23 for nRF52                  */
  __IOM uint32_t  STTCNFG_LR;                   /*!< (@ 0x0000082C) Strobe time tracking configuration in long range
                                                                    mode                                                       */
  __IOM uint32_t  LELRMISC;                     /*!< (@ 0x00000830) Miscellaneous Controls for Long Range                      */
  __IOM uint32_t  DRIFT_LR;                     /*!< (@ 0x00000834) Drift Controls in Long Range                               */
  __IOM uint32_t  QOVERRIDE25;                  /*!< (@ 0x00000838) TODO                                                       */
  __IOM uint32_t  DBCPEAKDETTHR;                /*!< (@ 0x0000083C) Thresholds for each peak detector instance                 */
  __IM  uint32_t  BITSLICER_STAT;               /*!< (@ 0x00000840) Payload status                                             */
  __IOM uint32_t  BBCTRL;                       /*!< (@ 0x00000844) Miscellaneous mode bits                                    */
  __IOM uint32_t  DBCCORR;                      /*!< (@ 0x00000848) Thresholds for the double correlator                       */
  __IOM uint32_t  DSSS;                         /*!< (@ 0x0000084C) DSSS synchronizer trim values                              */
  __IOM uint32_t  BSCONFIG;                     /*!< (@ 0x00000850) Bitslicer configuration                                    */
  __IOM uint32_t  MFB;                          /*!< (@ 0x00000854) Matched Filter Bank (MFB) configuration                    */
  __IOM uint32_t  DRIFT1;                       /*!< (@ 0x00000858) Drift Estimator configuration                              */
  __IOM uint32_t  DRIFT2;                       /*!< (@ 0x0000085C) Drift Estimator configuration                              */
  __IOM uint32_t  CN;                           /*!< (@ 0x00000860) Configuration for the CNRIPPLEWARN functionality
                                                                    used for BLE LR. Configuration is only enabled
                                                                    when OVRENCNRIPPLEWARNCFG in OVERRIDE23
                                                                    is set                                                     */
  __IOM uint32_t  PEAK;                         /*!< (@ 0x00000864) Peak detector configuration                                */
  __IOM uint32_t  STTCNFG;                      /*!< (@ 0x00000868) Strobe time tracking Configuration (Symbol Timing)         */
  __IOM uint32_t  BBCKSEL;                      /*!< (@ 0x0000086C) Clock rates                                                */
  __IM  uint32_t  RESERVED18[36];
