adamkondraciuk/nrfx/mdk/nrf54lilium_network.h
  __IM  uint32_t  DFESTATUS;                    /*!< (@ 0x00000900) DFE status information                                     */
  __IOM uint32_t  DFEMODE;                      /*!< (@ 0x00000904) Whether to use Angle-of-Arrival (AOA) or Angle-of-Departure
                                                                    (AOD)                                                      */
  __IOM uint32_t  DFECTRL1;                     /*!< (@ 0x00000908) Various configuration for Direction finding                */
  __IOM uint32_t  DFECTRL2;                     /*!< (@ 0x0000090C) Start offset for Direction finding                         */
  __IOM uint32_t  DFECTRL3;                     /*!< (@ 0x00000910) Various hacker/tuning configuration for Direction
                                                                    finding                                                    */
  __IOM uint32_t  DFECTRL4;                     /*!< (@ 0x00000914) Various hacker/tuning configuration for Direction
                                                                    finding                                                    */
  __IOM uint32_t  DFECTRL5;                     /*!< (@ 0x00000918) Various hacker/tuning configuration for Direction
                                                                    finding                                                    */
  __IM  uint32_t  SWITCHPATTERN;                /*!< (@ 0x0000091C) GPIO patterns to be used for each antenna                  */
  __OM  uint32_t  CLEARPATTERN;                 /*!< (@ 0x00000920) Clear the GPIO pattern array for antenna control           */
  __IOM uint32_t  DFEGPIO[8];                   /*!< (@ 0x00000924) Description collection: Pin select for DFE pin
                                                                    n                                                          */
  __OM  uint32_t  TASK_TRIG_START_DFE;          /*!< (@ 0x00000944) Unspecified                                                */
  __OM  uint32_t  TASK_TRIG_STOP_DFE;           /*!< (@ 0x00000948) Unspecified                                                */
  __IOM uint32_t  ENABLE_DFE;                   /*!< (@ 0x0000094C) Unspecified                                                */
  __IOM uint32_t  PTRDFE;                       /*!< (@ 0x00000950) Data pointer                                               */
  __IM  uint32_t  AMOUNTDFE;                    /*!< (@ 0x00000954) Number of samples transferred in the last transaction      */
  __IOM uint32_t  MAXCNTDFE;                    /*!< (@ 0x00000958) Maximum number of buffer words to transfer                 */
  __IM  uint32_t  RESERVED19[41];
  __OM  uint32_t  TASK_CNTSTART;                /*!< (@ 0x00000A00) Unspecified                                                */
  __OM  uint32_t  TASK_CNTSTOP;                 /*!< (@ 0x00000A04) Unspecified                                                */
  __OM  uint32_t  TASK_CNTCLEAR;                /*!< (@ 0x00000A08) Unspecified                                                */
  __IM  uint32_t  CRCSTATUS;                    /*!< (@ 0x00000A0C) CRC status                                                 */
  __IM  uint32_t  RXMATCH;                      /*!< (@ 0x00000A10) Received address                                           */
  __IM  uint32_t  RXCRC;                        /*!< (@ 0x00000A14) CRC field of previously received packet                    */
  __IM  uint32_t  DAI;                          /*!< (@ 0x00000A18) Device address match index                                 */
  __IM  uint32_t  PDUSTAT;                      /*!< (@ 0x00000A1C) Payload status                                             */
  __IOM uint32_t  PCNF0;                        /*!< (@ 0x00000A20) Packet configuration register 0                            */
  __IOM uint32_t  PCNF0SEC;                     /*!< (@ 0x00000A24) Unspecified                                                */
  __IOM uint32_t  PCNF1;                        /*!< (@ 0x00000A28) Packet configuration register 1                            */
  __IOM uint32_t  BASE0;                        /*!< (@ 0x00000A2C) Base address 0                                             */
  __IOM uint32_t  BASE1;                        /*!< (@ 0x00000A30) Base address 1                                             */
  __IOM uint32_t  PREFIX0;                      /*!< (@ 0x00000A34) Prefixes bytes for logical addresses 0-3                   */
  __IOM uint32_t  PREFIX1;                      /*!< (@ 0x00000A38) Prefixes bytes for logical addresses 4-7                   */
  __IOM uint32_t  TXADDRESS;                    /*!< (@ 0x00000A3C) Transmit address select                                    */
  __IOM uint32_t  RXADDRESSES;                  /*!< (@ 0x00000A40) Receive address select                                     */
  __IOM uint32_t  CRCCNF;                       /*!< (@ 0x00000A44) CRC configuration                                          */
  __IOM uint32_t  CRCPOLY;                      /*!< (@ 0x00000A48) CRC polynomial                                             */
  __IOM uint32_t  CRCINIT;                      /*!< (@ 0x00000A4C) CRC initial value                                          */
  __IOM uint32_t  DAB[8];                       /*!< (@ 0x00000A50) Description collection: Device address base segment
                                                                    n                                                          */
  __IOM uint32_t  DAP[8];                       /*!< (@ 0x00000A70) Description collection: Device address prefix
                                                                    n                                                          */
  __IOM uint32_t  DACNF;                        /*!< (@ 0x00000A90) Device address match configuration                         */
  __IOM uint32_t  BCC;                          /*!< (@ 0x00000A94) Bit counter compare                                        */
  __IOM uint32_t  AACHKOVERRIDE_TODO_FIX_NAMING;/*!< (@ 0x00000A98) Unspecified                                                */
  __IM  uint32_t  PACKETCNTR1;                  /*!< (@ 0x00000A9C) Unspecified                                                */
  __IM  uint32_t  PACKETCNTR2;                  /*!< (@ 0x00000AA0) Unspecified                                                */
  __IM  uint32_t  CTESTATUS;                    /*!< (@ 0x00000AA4) CTEInfo parsed from received packet                        */
  __IM  uint32_t  HYPSTDCHECKSTAT_TODO_FIX_NAMING;/*!< (@ 0x00000AA8) Unspecified                                              */
  __IM  uint32_t  HYPSTDAADIFFVEC_TODO_FIX_NAMING;/*!< (@ 0x00000AAC) Unspecified                                              */
  __IOM uint32_t  ADDRSAFECONF;                 /*!< (@ 0x00000AB0) Unspecified                                                */
  __IOM uint32_t  MHRMATCHCONF;                 /*!< (@ 0x00000AB4) Search pattern configuration                               */
  __IOM uint32_t  MHRMATCHMASK;                 /*!< (@ 0x00000AB8) Pattern mask                                               */
  __IOM uint32_t  SFD;                          /*!< (@ 0x00000ABC) IEEE 802.15.4 start of frame delimiter                     */
  __IOM uint32_t  CTEINLINECONF;                /*!< (@ 0x00000AC0) Configuration for CTE inline mode                          */
  __OM  uint32_t  TASK_TRIG_START_CHAIN;        /*!< (@ 0x00000AC4) Unspecified                                                */
  __OM  uint32_t  TASK_TRIG_STOP_CHAIN;         /*!< (@ 0x00000AC8) Unspecified                                                */
  __IOM uint32_t  ENABLE_CHAIN;                 /*!< (@ 0x00000ACC) Unspecified                                                */
  __IOM uint32_t  PACKETPTR;                    /*!< (@ 0x00000AD0) Packet pointer                                             */
  __IM  uint32_t  AMOUNT_CHAIN;                 /*!< (@ 0x00000AD4) Unspecified                                                */
  __IOM uint32_t  MAXCNT_CHAIN;                 /*!< (@ 0x00000AD8) Unspecified                                                */
  __IM  uint32_t  RESERVED20[9];
  __IOM uint32_t  TXCONFIG;                     /*!< (@ 0x00000B00) Tx configuration-                                          */
  __IM  uint32_t  RESERVED21[63];
  __IOM uint32_t  ADPLLCOMMAND;                 /*!< (@ 0x00000C00) Send or receive command directly to the AdPll
                                                                    digital island. Only write to this register
                                                                    when FSASYNCBUSBUSY returns 0                              */
  __IOM uint32_t  FSFREQFINETUNE;               /*!< (@ 0x00000C04) For finetuning the frequency                               */
  __IOM uint32_t  DEVIATION;                    /*!< (@ 0x00000C08) Frequency deviation for modulation                         */
  __IOM uint32_t  MODRATE;                      /*!< (@ 0x00000C0C) Select modulation rate                                     */
  __IOM uint32_t  MODFILTERING;                 /*!< (@ 0x00000C10) Select gaussian filtering mode                             */
  __IOM uint32_t  CUSTOMMODULATION;             /*!< (@ 0x00000C14) Enable reading from memory and passing data over
                                                                    to AdPll                                                   */
  __IOM uint32_t  FSCLOCKSELECT;                /*!< (@ 0x00000C18) Set the clock source for the AdPll digital island          */
  __IM  uint32_t  FSUNITRIGCALVAL;              /*!< (@ 0x00000C1C) Read the calibrated value for the universal trigger        */
  __IOM uint32_t  FSUNITRIGMANUAL;              /*!< (@ 0x00000C20) Manual control of the uni trigger signals. Note
                                                                    that fsUniTriggerCalWord is controlled by
                                                                    writing to the separate register FSUNITRIGCALVAL           */
  __IM  uint32_t  FSUNITRIGCALOUT;              /*!< (@ 0x00000C24) Read the signal directly from fsUniTriggerCalOut           */
  __IOM uint32_t  FSASYNCBUSCONF;               /*!< (@ 0x00000C28) Some special settings for the asynchronous bus
                                                                    configuration                                              */
  __IM  uint32_t  FSASYNCBUSBUSY;               /*!< (@ 0x00000C2C) Status bit indicating whether the bus is currently
                                                                    busy or not                                                */
  __IOM uint32_t  VARIOUS_BACKDOORS;            /*!< (@ 0x00000C30) This value is written to the AdPll when powering
                                                                    up the digital island                                      */
  __IM  uint32_t  RESERVED22[3];
  __IOM uint32_t  EXPECTEDPVTTOTRATIO;          /*!< (@ 0x00000C40) This value is written to the AdPll when powering
                                                                    up the digital island                                      */
  __IOM uint32_t  ESTKDTCVAL;                   /*!< (@ 0x00000C44) This value is written to the AdPll when powering
                                                                    up the digital island                                      */
  __IOM uint32_t  TXINTERFACEHFGAIN;            /*!< (@ 0x00000C48) This value is written to the AdPll when powering
                                                                    up the digital island                                      */
  __IOM uint32_t  TRACING;                      /*!< (@ 0x00000C4C) Enable tracing from AdPll                                  */
  __IOM uint32_t  IFFREQ;                       /*!< (@ 0x00000C50) Select between two different IF frequencies                */
  __IM  uint32_t  ADPLLCOMPANIONSTATE;          /*!< (@ 0x00000C54) State in the AdPllCompanion state machines                 */
  __IM  uint32_t  RESERVED23[6];
  __IOM uint32_t  RELOADFREQ;                   /*!< (@ 0x00000C70) Non-official task: AdPll will reread the frequency
                                                                    input signal                                               */
  __IOM uint32_t  UNITRIGCALSTART;              /*!< (@ 0x00000C74) Non-official task: Start automatic universal
                                                                    trigger calibration                                        */
  __IOM uint32_t  FSSENDSETTINGS;               /*!< (@ 0x00000C78) Non-official task: Send the auto-settings to
                                                                    AdPll again. This also happens at every
                                                                    startup                                                    */
  __IM  uint32_t  RESERVED24;
  __IOM uint32_t  UNITRIGCALDONE;               /*!< (@ 0x00000C80) Non-official event: Start automatic universal
                                                                    trigger calibration                                        */
  __IOM uint32_t  REJECTEDTRANS;                /*!< (@ 0x00000C84) Non-official event: The command written to AdPll
                                                                    was rejected because of an ongoing transaction             */
  __IOM uint32_t  COMPLETETRANS;                /*!< (@ 0x00000C88) Non-official event: Completed a transaction to
                                                                    AdPll successfully ((only when CHECKSTATUS
                                                                    is set)                                                    */
  __IOM uint32_t  FAILEDTRANS;                  /*!< (@ 0x00000C8C) Non-official event: Did not successfully complete
                                                                    a transaction to AdPll. (only when CHECKSTATUS
                                                                    is set)                                                    */
  __IM  uint32_t  RESERVED25[4];
  __IOM uint32_t  ADPLL_STARTUP_COMMAND0;       /*!< (@ 0x00000CA0) This value is written to the AdPll when powering
                                                                    up the digital island                                      */
  __IOM uint32_t  ADPLL_STARTUP_COMMAND1;       /*!< (@ 0x00000CA4) This value is written to the AdPll when powering
                                                                    up the digital island                                      */
  __IOM uint32_t  ADPLL_STARTUP_COMMAND2;       /*!< (@ 0x00000CA8) This value is written to the AdPll when powering
                                                                    up the digital island                                      */
  __IOM uint32_t  ADPLL_STARTUP_COMMAND3;       /*!< (@ 0x00000CAC) This value is written to the AdPll when powering
                                                                    up the digital island                                      */
  __IOM uint32_t  ADPLL_STARTUP_COMMAND4;       /*!< (@ 0x00000CB0) This value is written to the AdPll when powering
                                                                    up the digital island                                      */
  __IOM uint32_t  ADPLL_STARTUP_COMMAND5;       /*!< (@ 0x00000CB4) This value is written to the AdPll when powering
                                                                    up the digital island                                      */
  __IOM uint32_t  ADPLL_STARTUP_COMMAND6;       /*!< (@ 0x00000CB8) This value is written to the AdPll when powering
                                                                    up the digital island                                      */
  __IOM uint32_t  ADPLL_STARTUP_COMMAND7;       /*!< (@ 0x00000CBC) This value is written to the AdPll when powering
                                                                    up the digital island                                      */
  __IM  uint32_t  RESERVED26[4];
  __IOM uint32_t  ADPLLCOMPANION_INTEN;         /*!< (@ 0x00000CD0) Unspecified                                                */
  __IOM uint32_t  ADPLLCOMPANION_INTENSET;      /*!< (@ 0x00000CD4) Unspecified                                                */
  __IOM uint32_t  ADPLLCOMPANION_INTENCLR;      /*!< (@ 0x00000CD8) Unspecified                                                */
  __IM  uint32_t  ADPLLCOMPANION_INTPEND;       /*!< (@ 0x00000CDC) Unspecified                                                */
  __IM  uint32_t  RESERVED27[8];
  __IOM uint32_t  SUBSCRIBE_TXEN;               /*!< (@ 0x00000D00) Unspecified                                                */
  __IOM uint32_t  SUBSCRIBE_RXEN;               /*!< (@ 0x00000D04) Unspecified                                                */
  __IOM uint32_t  SUBSCRIBE_START;              /*!< (@ 0x00000D08) Unspecified                                                */
  __IOM uint32_t  SUBSCRIBE_STOP;               /*!< (@ 0x00000D0C) Unspecified                                                */
  __IOM uint32_t  SUBSCRIBE_DISABLE;            /*!< (@ 0x00000D10) Unspecified                                                */
  __IOM uint32_t  SUBSCRIBE_RSSISTART;          /*!< (@ 0x00000D14) Unspecified                                                */
  __IOM uint32_t  SUBSCRIBE_BCSTART;            /*!< (@ 0x00000D18) Unspecified                                                */
  __IOM uint32_t  SUBSCRIBE_BCSTOP;             /*!< (@ 0x00000D1C) Unspecified                                                */
  __IOM uint32_t  SUBSCRIBE_EDSTART;            /*!< (@ 0x00000D20) Unspecified                                                */
  __IOM uint32_t  SUBSCRIBE_EDSTOP;             /*!< (@ 0x00000D24) Unspecified                                                */
  __IOM uint32_t  SUBSCRIBE_CCASTART;           /*!< (@ 0x00000D28) Unspecified                                                */
  __IOM uint32_t  SUBSCRIBE_CCASTOP;            /*!< (@ 0x00000D2C) Unspecified                                                */
  __IOM uint32_t  SUBSCRIBE_DFESTART;           /*!< (@ 0x00000D30) Unspecified                                                */
  __IOM uint32_t  SUBSCRIBE_DFESTOP;            /*!< (@ 0x00000D34) Unspecified                                                */
  __IOM uint32_t  SUBSCRIBE_ACQINJ0DMASTART;    /*!< (@ 0x00000D38) Unspecified                                                */
  __IOM uint32_t  SUBSCRIBE_ACQINJ0DMASTOP;     /*!< (@ 0x00000D3C) Unspecified                                                */
  __IOM uint32_t  SUBSCRIBE_ACQINJ1DMASTART;    /*!< (@ 0x00000D40) Unspecified                                                */
  __IOM uint32_t  SUBSCRIBE_ACQINJ1DMASTOP;     /*!< (@ 0x00000D44) Unspecified                                                */
  __IOM uint32_t  SUBSCRIBE_CNTPSTART;          /*!< (@ 0x00000D48) Unspecified                                                */
  __IOM uint32_t  SUBSCRIBE_CNTPSTOP;           /*!< (@ 0x00000D4C) Unspecified                                                */
  __IOM uint32_t  SUBSCRIBE_CNTPCLEAR;          /*!< (@ 0x00000D50) Unspecified                                                */
  __IOM uint32_t  SUBSCRIBE_LOOPBACKEN;         /*!< (@ 0x00000D54) Unspecified                                                */
  __IOM uint32_t  SUBSCRIBE_CALSTART;           /*!< (@ 0x00000D58) Unspecified                                                */
  __IOM uint32_t  SUBSCRIBE_CALSTOP;            /*!< (@ 0x00000D5C) Unspecified                                                */
  __IOM uint32_t  SUBSCRIBE_PATESTSTART;        /*!< (@ 0x00000D60) Unspecified                                                */
  __IOM uint32_t  SUBSCRIBE_PATESTSTOP;         /*!< (@ 0x00000D64) Unspecified                                                */
  __IOM uint32_t  SUBSCRIBE_CHNOINCR;           /*!< (@ 0x00000D68) Unspecified                                                */
  __IOM uint32_t  SUBSCRIBE_DMASTART;           /*!< (@ 0x00000D6C) Unspecified                                                */
  __IOM uint32_t  SUBSCRIBE_DMASTOP;            /*!< (@ 0x00000D70) Unspecified                                                */
  __IOM uint32_t  SUBSCRIBE_DFEDMASTART;        /*!< (@ 0x00000D74) Unspecified                                                */
  __IOM uint32_t  SUBSCRIBE_DFEDMASTOP;         /*!< (@ 0x00000D78) Unspecified                                                */
  __IOM uint32_t  SUBSCRIBE_RESERVED31;         /*!< (@ 0x00000D7C) Unspecified                                                */
  __IOM uint32_t  SUBSCRIBE_GETNEXTDETECT;      /*!< (@ 0x00000D80) Unspecified                                                */
  __IOM uint32_t  SUBSCRIBE_CLEARDETECTFIFO;    /*!< (@ 0x00000D84) Unspecified                                                */
  __IOM uint32_t  SUBSCRIBE_RESETDEMODCTRL;     /*!< (@ 0x00000D88) Unspecified                                                */
  __IOM uint32_t  SUBSCRIBE_DEMODCTRLSTARTTIMER;/*!< (@ 0x00000D8C) Unspecified                                                */
  __IOM uint32_t  SUBSCRIBE_DEMODCTRLSTOPTIMER; /*!< (@ 0x00000D90) Unspecified                                                */
  __IOM uint32_t  SUBSCRIBE_DEMODCTRLCONDEN0;   /*!< (@ 0x00000D94) Unspecified                                                */
  __IOM uint32_t  SUBSCRIBE_DEMODCTRLCONDEN1;   /*!< (@ 0x00000D98) Unspecified                                                */
  __IOM uint32_t  SUBSCRIBE_DEMODCTRLCONDEN2;   /*!< (@ 0x00000D9C) Unspecified                                                */
  __IM  uint32_t  RESERVED28[24];
  __IOM uint32_t  PUBLISH_READY;                /*!< (@ 0x00000E00) Unspecified                                                */
  __IOM uint32_t  PUBLISH_TXREADY;              /*!< (@ 0x00000E04) Unspecified                                                */
  __IOM uint32_t  PUBLISH_RXREADY;              /*!< (@ 0x00000E08) Unspecified                                                */
  __IOM uint32_t  PUBLISH_ADDRESS;              /*!< (@ 0x00000E0C) Unspecified                                                */
  __IOM uint32_t  PUBLISH_FRAMESTART;           /*!< (@ 0x00000E10) Unspecified                                                */
  __IOM uint32_t  PUBLISH_PAYLOAD;              /*!< (@ 0x00000E14) Unspecified                                                */
  __IOM uint32_t  PUBLISH_END;                  /*!< (@ 0x00000E18) Unspecified                                                */
  __IOM uint32_t  PUBLISH_PHYEND;               /*!< (@ 0x00000E1C) Unspecified                                                */
  __IOM uint32_t  PUBLISH_DISABLED;             /*!< (@ 0x00000E20) Unspecified                                                */
  __IOM uint32_t  PUBLISH_DEVMATCH;             /*!< (@ 0x00000E24) Unspecified                                                */
  __IOM uint32_t  PUBLISH_DEVMISS;              /*!< (@ 0x00000E28) Unspecified                                                */
  __IOM uint32_t  PUBLISH_CRCOK;                /*!< (@ 0x00000E2C) Unspecified                                                */
  __IOM uint32_t  PUBLISH_CRCERROR;             /*!< (@ 0x00000E30) Unspecified                                                */
