adamkondraciuk/nrfx/mdk/nrf54lilium_network.h
  __IOM uint32_t  PUBLISH_RESERVED13;           /*!< (@ 0x00000E34) Unspecified                                                */
  __IOM uint32_t  PUBLISH_BCMATCH;              /*!< (@ 0x00000E38) Unspecified                                                */
  __IOM uint32_t  PUBLISH_EDEND;                /*!< (@ 0x00000E3C) Unspecified                                                */
  __IOM uint32_t  PUBLISH_EDSTOPPED;            /*!< (@ 0x00000E40) Unspecified                                                */
  __IOM uint32_t  PUBLISH_CCAIDLE;              /*!< (@ 0x00000E44) Unspecified                                                */
  __IOM uint32_t  PUBLISH_CCABUSY;              /*!< (@ 0x00000E48) Unspecified                                                */
  __IOM uint32_t  PUBLISH_CCASTOPPED;           /*!< (@ 0x00000E4C) Unspecified                                                */
  __IOM uint32_t  PUBLISH_RATEBOOST;            /*!< (@ 0x00000E50) Unspecified                                                */
  __IOM uint32_t  PUBLISH_MHRMATCH;             /*!< (@ 0x00000E54) Unspecified                                                */
  __IOM uint32_t  PUBLISH_SYNC;                 /*!< (@ 0x00000E58) Unspecified                                                */
  __IOM uint32_t  PUBLISH_CTEPRESENT;           /*!< (@ 0x00000E5C) Unspecified                                                */
  __IOM uint32_t  PUBLISH_CTEWARNING;           /*!< (@ 0x00000E60) Unspecified                                                */
  __IOM uint32_t  PUBLISH_DFEEND;               /*!< (@ 0x00000E64) Unspecified                                                */
  __IOM uint32_t  PUBLISH_MODEWRITTEN;          /*!< (@ 0x00000E68) Unspecified                                                */
  __IOM uint32_t  PUBLISH_MODEREADY;            /*!< (@ 0x00000E6C) Unspecified                                                */
  __IOM uint32_t  PUBLISH_CTEEND;               /*!< (@ 0x00000E70) Unspecified                                                */
  __IOM uint32_t  PUBLISH_LBREADY;              /*!< (@ 0x00000E74) Unspecified                                                */
  __IOM uint32_t  PUBLISH_CALDONE;              /*!< (@ 0x00000E78) Unspecified                                                */
  __IOM uint32_t  PUBLISH_CHNOUPDATED;          /*!< (@ 0x00000E7C) Unspecified                                                */
  __IOM uint32_t  PUBLISH_DBCTIMEOUT;           /*!< (@ 0x00000E80) Unspecified                                                */
  __IOM uint32_t  PUBLISH_TXTIMERMATCH;         /*!< (@ 0x00000E84) Unspecified                                                */
  __IOM uint32_t  PUBLISH_RXTIMERMATCH;         /*!< (@ 0x00000E88) Unspecified                                                */
  __IOM uint32_t  PUBLISH_RESERVED35;           /*!< (@ 0x00000E8C) Unspecified                                                */
  __IOM uint32_t  PUBLISH_RXDIGEN;              /*!< (@ 0x00000E90) Unspecified                                                */
  __IOM uint32_t  PUBLISH_RAWDETECT;            /*!< (@ 0x00000E94) Unspecified                                                */
  __IOM uint32_t  PUBLISH_DETECTFIFOFULL;       /*!< (@ 0x00000E98) Unspecified                                                */
  __IOM uint32_t  PUBLISH_TIMERWRAPS;           /*!< (@ 0x00000E9C) Unspecified                                                */
  __IOM uint32_t  PUBLISH_STROBETIMETRACKUPDATED;/*!< (@ 0x00000EA0) Unspecified                                               */
  __IOM uint32_t  PUBLISH_DEMODCTRLCONDTRIGGERED0;/*!< (@ 0x00000EA4) Unspecified                                              */
  __IOM uint32_t  PUBLISH_DEMODCTRLCONDTRIGGERED1;/*!< (@ 0x00000EA8) Unspecified                                              */
  __IOM uint32_t  PUBLISH_DEMODCTRLCONDTRIGGERED2;/*!< (@ 0x00000EAC) Unspecified                                              */
  __IOM uint32_t  PUBLISH_RESERVED44;           /*!< (@ 0x00000EB0) Unspecified                                                */
  __IOM uint32_t  PUBLISH_RESERVED45;           /*!< (@ 0x00000EB4) Unspecified                                                */
  __IOM uint32_t  PUBLISH_RESERVED46;           /*!< (@ 0x00000EB8) Unspecified                                                */
  __IOM uint32_t  PUBLISH_RESERVED47;           /*!< (@ 0x00000EBC) Unspecified                                                */
  __IOM uint32_t  PUBLISH_ACQINJ0DMAEND;        /*!< (@ 0x00000EC0) Unspecified                                                */
  __IOM uint32_t  PUBLISH_ACQINJ1DMAEND;        /*!< (@ 0x00000EC4) Unspecified                                                */
  __IM  uint32_t  RESERVED29[14];
  __OM  uint32_t  TASK_TRIG_ZERO_PENALTY_PCP_4; /*!< (@ 0x00000F00) Unspecified                                                */
  __OM  uint32_t  TASK_TRIG_FULL_PENALTY_PCP_4; /*!< (@ 0x00000F04) Unspecified                                                */
  __OM  uint32_t  TASK_TRIG_ZERO_PENALTY_PCP_3; /*!< (@ 0x00000F08) Unspecified                                                */
  __OM  uint32_t  TASK_TRIG_FULL_PENALTY_PCP_3; /*!< (@ 0x00000F0C) Unspecified                                                */
  __OM  uint32_t  TASK_TRIG_ZERO_PENALTY_PCP_2; /*!< (@ 0x00000F10) Unspecified                                                */
  __OM  uint32_t  TASK_TRIG_FULL_PENALTY_PCP_2; /*!< (@ 0x00000F14) Unspecified                                                */
  __OM  uint32_t  TASK_TRIG_ZERO_PENALTY_PCP_1; /*!< (@ 0x00000F18) Unspecified                                                */
  __OM  uint32_t  TASK_TRIG_FULL_PENALTY_PCP_1; /*!< (@ 0x00000F1C) Unspecified                                                */
  __OM  uint32_t  TASK_TRIG_ZERO_PENALTY_PCP_0; /*!< (@ 0x00000F20) Unspecified                                                */
  __OM  uint32_t  TASK_TRIG_FULL_PENALTY_PCP_0; /*!< (@ 0x00000F24) Unspecified                                                */
  __IOM uint32_t  PENALTY_RG_PCP_0;             /*!< (@ 0x00000F28) Unspecified                                                */
  __IOM uint32_t  PENALTY_RG_PCP_1;             /*!< (@ 0x00000F2C) Unspecified                                                */
  __IOM uint32_t  PENALTY_RG_PCP_2;             /*!< (@ 0x00000F30) Unspecified                                                */
  __IOM uint32_t  PENALTY_RG_PCP_3;             /*!< (@ 0x00000F34) Unspecified                                                */
  __IOM uint32_t  PENALTY_RG_PCP_4;             /*!< (@ 0x00000F38) Unspecified                                                */
  __IM  uint32_t  TURN_OFF_AUTO_CLOCKSOURCE_REQ;/*!< (@ 0x00000F3C) Unspecified                                                */
  __IOM uint32_t  FORCE_OVERRIDE_PCP_0;         /*!< (@ 0x00000F40) Unspecified                                                */
  __IOM uint32_t  FORCE_OVERRIDE_PCP_1;         /*!< (@ 0x00000F44) Unspecified                                                */
  __IOM uint32_t  FORCE_OVERRIDE_PCP_2;         /*!< (@ 0x00000F48) Unspecified                                                */
  __IOM uint32_t  FORCE_OVERRIDE_PCP_3;         /*!< (@ 0x00000F4C) Unspecified                                                */
  __IOM uint32_t  FORCE_OVERRIDE_PCP_4;         /*!< (@ 0x00000F50) Unspecified                                                */
} NRF_RADIO_Type;                               /*!< Size = 3924 (0xf54)                                                       */



/* =========================================================================================================================== */
/* ================                                            ECB                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief AES ECB Mode Encryption (ECB)
  */

