adamkondraciuk/nrfx/mdk/nrf54lilium_network.h
typedef struct {                                /*!< (@ 0x4100D000) ECB Structure                                              */
  __OM  uint32_t  TASKS_CONFIG;                 /*!< (@ 0x00000000) Fetches AES Key from CONFIGPTR job list into
                                                                    the KEY registers                                          */
  __OM  uint32_t  TASKS_STARTECB;               /*!< (@ 0x00000004) Start ECB block encrypt                                    */
  __OM  uint32_t  TASKS_STOPECB;                /*!< (@ 0x00000008) Abort a possible executing ECB operation                   */
  __IM  uint32_t  RESERVED[29];
  __IOM uint32_t  SUBSCRIBE_CONFIG;             /*!< (@ 0x00000080) Subscribe configuration for task CONFIG                    */
  __IOM uint32_t  SUBSCRIBE_STARTECB;           /*!< (@ 0x00000084) Subscribe configuration for task STARTECB                  */
  __IOM uint32_t  SUBSCRIBE_STOPECB;            /*!< (@ 0x00000088) Subscribe configuration for task STOPECB                   */
  __IM  uint32_t  RESERVED1[29];
  __IOM uint32_t  EVENTS_ENDCONFIG;             /*!< (@ 0x00000100) ECB block configuration complete                           */
  __IOM uint32_t  EVENTS_ENDECB;                /*!< (@ 0x00000104) ECB block encrypt complete                                 */
  __IOM uint32_t  EVENTS_ERRORECB;              /*!< (@ 0x00000108) ECB block encrypt aborted because of a STOPECB
                                                                    task or due to an error                                    */
  __IM  uint32_t  RESERVED2[29];
  __IOM uint32_t  PUBLISH_ENDCONFIG;            /*!< (@ 0x00000180) Publish configuration for event ENDCONFIG                  */
  __IOM uint32_t  PUBLISH_ENDECB;               /*!< (@ 0x00000184) Publish configuration for event ENDECB                     */
  __IOM uint32_t  PUBLISH_ERRORECB;             /*!< (@ 0x00000188) Publish configuration for event ERRORECB                   */
  __IM  uint32_t  RESERVED3[94];
  __IOM uint32_t  INTENSET;                     /*!< (@ 0x00000304) Enable interrupt                                           */
  __IOM uint32_t  INTENCLR;                     /*!< (@ 0x00000308) Disable interrupt                                          */
  __IM  uint32_t  RESERVED4[129];
  __IOM ECB_KEY_Type KEY;                       /*!< (@ 0x00000510) Unspecified                                                */
  __IM  uint32_t  RESERVED5[4];
  __IOM uint32_t  INPTR;                        /*!< (@ 0x00000530) ECB input pointer                                          */
  __IM  uint32_t  INPTRAMOUNT;                  /*!< (@ 0x00000534) Number of bytes read from the input data, not
                                                                    including the job list structure                           */
  __IOM uint32_t  OUTPTR;                       /*!< (@ 0x00000538) Output pointer Points to a job list containing
                                                                    encrypted ECB data structure                               */
  __IM  uint32_t  OUTPTRAMOUNT;                 /*!< (@ 0x0000053C) Number of bytes available in the output data,
                                                                    not including the job list structure                       */
} NRF_ECB_Type;                                 /*!< Size = 1344 (0x540)                                                       */



/* =========================================================================================================================== */
/* ================                                            AAR                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Accelerated Address Resolver (AAR)
  */

typedef struct {                                /*!< (@ 0x4100E000) AAR Structure                                              */
  __OM  uint32_t  TASKS_START;                  /*!< (@ 0x00000000) Start resolving addresses based on IRKs specified
                                                                    in the IRK data structure                                  */
  __IM  uint32_t  RESERVED;
  __OM  uint32_t  TASKS_STOP;                   /*!< (@ 0x00000008) Stop resolving addresses                                   */
  __IM  uint32_t  RESERVED1[29];
  __IOM uint32_t  SUBSCRIBE_START;              /*!< (@ 0x00000080) Subscribe configuration for task START                     */
  __IM  uint32_t  RESERVED2;
  __IOM uint32_t  SUBSCRIBE_STOP;               /*!< (@ 0x00000088) Subscribe configuration for task STOP                      */
  __IM  uint32_t  RESERVED3[29];
  __IOM uint32_t  EVENTS_END;                   /*!< (@ 0x00000100) Address resolution procedure complete                      */
  __IOM uint32_t  EVENTS_RESOLVED;              /*!< (@ 0x00000104) Address resolved                                           */
  __IOM uint32_t  EVENTS_NOTRESOLVED;           /*!< (@ 0x00000108) Address not resolved                                       */
  __IM  uint32_t  RESERVED4[29];
  __IOM uint32_t  PUBLISH_END;                  /*!< (@ 0x00000180) Publish configuration for event END                        */
  __IOM uint32_t  PUBLISH_RESOLVED;             /*!< (@ 0x00000184) Publish configuration for event RESOLVED                   */
  __IOM uint32_t  PUBLISH_NOTRESOLVED;          /*!< (@ 0x00000188) Publish configuration for event NOTRESOLVED                */
  __IM  uint32_t  RESERVED5[93];
  __IOM uint32_t  INTEN;                        /*!< (@ 0x00000300) Enable or disable interrupt                                */
  __IOM uint32_t  INTENSET;                     /*!< (@ 0x00000304) Enable interrupt                                           */
  __IOM uint32_t  INTENCLR;                     /*!< (@ 0x00000308) Disable interrupt                                          */
  __IM  uint32_t  RESERVED6[61];
  __IM  uint32_t  STATUS;                       /*!< (@ 0x00000400) Resolution status                                          */
  __IM  uint32_t  RESERVED7[63];
  __IOM uint32_t  ENABLE;                       /*!< (@ 0x00000500) Enable AAR                                                 */
  __IM  uint32_t  RESERVED8[11];
  __IOM uint32_t  INPTR;                        /*!< (@ 0x00000530) Pointer to the AAR data structure                          */
} NRF_AAR_Type;                                 /*!< Size = 1332 (0x534)                                                       */



/* =========================================================================================================================== */
/* ================                                            CCM                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief AES CCM mode encryption (CCM)
  */

typedef struct {                                /*!< (@ 0x4100E000) CCM Structure                                              */
  __OM  uint32_t  TASKS_CONFIG;                 /*!< (@ 0x00000000) Fetches AES Key and CCM Nonce from CONFIGPTR
                                                                    job list into the KEY and NONCE registers.                 */
  __OM  uint32_t  TASKS_CRYPT;                  /*!< (@ 0x00000004) Start encryption/decryption. This operation will
                                                                    stop by itself when completed.                             */
  __OM  uint32_t  TASKS_STOP;                   /*!< (@ 0x00000008) Stop encryption/decryption                                 */
  __OM  uint32_t  TASKS_RATEOVERRIDE;           /*!< (@ 0x0000000C) Override DATARATE setting in MODE register with
                                                                    the contents of the RATEOVERRIDE register
                                                                    for any ongoing encryption/decryption                      */
  __OM  uint32_t  TASKS_PROCESS;                /*!< (@ 0x00000010) Fetches and processes one byte from INPTR in
                                                                    manual data rate mode                                      */
  __IM  uint32_t  RESERVED[27];
  __IOM uint32_t  SUBSCRIBE_CONFIG;             /*!< (@ 0x00000080) Subscribe configuration for task CONFIG                    */
  __IOM uint32_t  SUBSCRIBE_CRYPT;              /*!< (@ 0x00000084) Subscribe configuration for task CRYPT                     */
  __IOM uint32_t  SUBSCRIBE_STOP;               /*!< (@ 0x00000088) Subscribe configuration for task STOP                      */
  __IOM uint32_t  SUBSCRIBE_RATEOVERRIDE;       /*!< (@ 0x0000008C) Subscribe configuration for task RATEOVERRIDE              */
  __IOM uint32_t  SUBSCRIBE_PROCESS;            /*!< (@ 0x00000090) Subscribe configuration for task PROCESS                   */
  __IM  uint32_t  RESERVED1[27];
  __IOM uint32_t  EVENTS_ENDCONFIG;             /*!< (@ 0x00000100) Configuration data has been loaded                         */
  __IOM uint32_t  EVENTS_ENDCRYPT;              /*!< (@ 0x00000104) Encrypt/decrypt complete                                   */
  __IOM uint32_t  EVENTS_ERROR;                 /*!< (@ 0x00000108) CCM error event                                            */
  __IM  uint32_t  RESERVED2[29];
  __IOM uint32_t  PUBLISH_ENDCONFIG;            /*!< (@ 0x00000180) Publish configuration for event ENDCONFIG                  */
  __IOM uint32_t  PUBLISH_ENDCRYPT;             /*!< (@ 0x00000184) Publish configuration for event ENDCRYPT                   */
  __IOM uint32_t  PUBLISH_ERROR;                /*!< (@ 0x00000188) Publish configuration for event ERROR                      */
  __IM  uint32_t  RESERVED3[29];
  __IOM uint32_t  SHORTS;                       /*!< (@ 0x00000200) Shortcuts between local events and tasks                   */
  __IM  uint32_t  RESERVED4[64];
  __IOM uint32_t  INTENSET;                     /*!< (@ 0x00000304) Enable interrupt                                           */
  __IOM uint32_t  INTENCLR;                     /*!< (@ 0x00000308) Disable interrupt                                          */
  __IM  uint32_t  RESERVED5[61];
  __IM  uint32_t  MACSTATUS;                    /*!< (@ 0x00000400) MAC check result                                           */
  __IM  uint32_t  ERRORSTATUS;                  /*!< (@ 0x00000404) Error status                                               */
  __IM  uint32_t  RESERVED6[62];
  __IOM uint32_t  ENABLE;                       /*!< (@ 0x00000500) Enable                                                     */
  __IOM uint32_t  MODE;                         /*!< (@ 0x00000504) Operation mode                                             */
  __IM  uint32_t  RESERVED7[2];
  __IOM CCM_KEY_Type KEY;                       /*!< (@ 0x00000510) Unspecified                                                */
  __IOM CCM_NONCE_Type NONCE;                   /*!< (@ 0x00000520) Unspecified                                                */
  __IOM uint32_t  INPTR;                        /*!< (@ 0x00000530) Input pointer Points to a job list containing
                                                                    unencrypted CCM data structure in Encryption
                                                                    mode Points to a job list containing encrypted
                                                                    CCM data structure in Decryption mode                      */
  __IM  uint32_t  INAMOUNT;                     /*!< (@ 0x00000534) Number of bytes read from the input data, not
                                                                    including the job list structure                           */
  __IOM uint32_t  OUTPTR;                       /*!< (@ 0x00000538) Output pointer Points to a job list containing
                                                                    encrypted CCM data structure in Encryption
                                                                    mode Points to a job list containing decrypted
                                                                    CCM data structure in Decryption mode                      */
  __IM  uint32_t  OUTAMOUNT;                    /*!< (@ 0x0000053C) Number of bytes available in the output data,
                                                                    not including the job list structure                       */
  __IOM uint32_t  RATEOVERRIDE;                 /*!< (@ 0x00000540) Data rate override setting.                                */
  __IOM uint32_t  ADATAMASK;                    /*!< (@ 0x00000544) CCM adata mask.                                            */
} NRF_CCM_Type;                                 /*!< Size = 1352 (0x548)                                                       */



/* =========================================================================================================================== */
/* ================                                           TEMP                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Temperature Sensor (TEMP)
  */

typedef struct {                                /*!< (@ 0x41010000) TEMP Structure                                             */
  __OM  uint32_t  TASKS_START;                  /*!< (@ 0x00000000) Start temperature measurement                              */
  __OM  uint32_t  TASKS_STOP;                   /*!< (@ 0x00000004) Stop temperature measurement                               */
  __IM  uint32_t  RESERVED[30];
  __IOM uint32_t  SUBSCRIBE_START;              /*!< (@ 0x00000080) Subscribe configuration for task START                     */
  __IOM uint32_t  SUBSCRIBE_STOP;               /*!< (@ 0x00000084) Subscribe configuration for task STOP                      */
  __IM  uint32_t  RESERVED1[30];
  __IOM uint32_t  EVENTS_DATARDY;               /*!< (@ 0x00000100) Temperature measurement complete, data ready               */
  __IM  uint32_t  RESERVED2[31];
  __IOM uint32_t  PUBLISH_DATARDY;              /*!< (@ 0x00000180) Publish configuration for event DATARDY                    */
  __IM  uint32_t  RESERVED3[95];
  __IOM uint32_t  INTEN;                        /*!< (@ 0x00000300) Enable or disable interrupt                                */
  __IOM uint32_t  INTENSET;                     /*!< (@ 0x00000304) Enable interrupt                                           */
  __IOM uint32_t  INTENCLR;                     /*!< (@ 0x00000308) Disable interrupt                                          */
  __IM  uint32_t  RESERVED4[125];
  __IOM uint32_t  ENABLE;                       /*!< (@ 0x00000500) Enable temperature sensor bias current                     */
  __IOM int32_t   COUNTER;                      /*!< (@ 0x00000504) Prototype register containing counter values
                                                                    for timing                                                 */
  __IM  int32_t   TEMP;                         /*!< (@ 0x00000508) Temperature in degC (0.25deg steps)                        */
  __IM  int32_t   TEMPRAW;                      /*!< (@ 0x0000050C) Counted oscillator pulses which is equivalent
                                                                    to temperature without calibration and linearization       */
  __IM  uint32_t  DATA;                         /*!< (@ 0x00000510) Data after dec and calib                                   */
  __IOM uint32_t  CALIB;                        /*!< (@ 0x00000514) Calibration value.                                         */
  __IOM int32_t   TEMPSENSE_ANA_CONF;           /*!< (@ 0x00000518) Analog test bus control                                    */
  __IM  uint32_t  RESERVED5;
  __IOM uint32_t  A0;                           /*!< (@ 0x00000520) Slope of 1st piece wise linear function                    */
  __IOM uint32_t  A1;                           /*!< (@ 0x00000524) Slope of 2nd piece wise linear function                    */
  __IOM uint32_t  A2;                           /*!< (@ 0x00000528) Slope of 3rd piece wise linear function                    */
  __IOM uint32_t  A3;                           /*!< (@ 0x0000052C) Slope of 4th piece wise linear function                    */
  __IOM uint32_t  A4;                           /*!< (@ 0x00000530) Slope of 5th piece wise linear function                    */
  __IOM uint32_t  A5;                           /*!< (@ 0x00000534) Slope of 6th piece wise linear function                    */
  __IOM uint32_t  A6;                           /*!< (@ 0x00000538) Slope of 7th piece wise linear function                    */
  __IM  uint32_t  RESERVED6;
  __IOM uint32_t  B0;                           /*!< (@ 0x00000540) y-intercept of 1st piece wise linear function              */
  __IOM uint32_t  B1;                           /*!< (@ 0x00000544) y-intercept of 2nd piece wise linear function              */
  __IOM uint32_t  B2;                           /*!< (@ 0x00000548) y-intercept of 3rd piece wise linear function              */
  __IOM uint32_t  B3;                           /*!< (@ 0x0000054C) y-intercept of 4th piece wise linear function              */
  __IOM uint32_t  B4;                           /*!< (@ 0x00000550) y-intercept of 5th piece wise linear function              */
  __IOM uint32_t  B5;                           /*!< (@ 0x00000554) y-intercept of 6th piece wise linear function              */
  __IOM uint32_t  B6;                           /*!< (@ 0x00000558) y-intercept of 7th piece wise linear function              */
  __IM  uint32_t  RESERVED7;
  __IOM uint32_t  T0;                           /*!< (@ 0x00000560) End point of 1st piece wise linear function                */
  __IOM uint32_t  T1;                           /*!< (@ 0x00000564) End point of 2nd piece wise linear function                */
  __IOM uint32_t  T2;                           /*!< (@ 0x00000568) End point of 3rd piece wise linear function                */
  __IOM uint32_t  T3;                           /*!< (@ 0x0000056C) End point of 4th piece wise linear function                */
  __IOM uint32_t  T4;                           /*!< (@ 0x00000570) End point of 5th piece wise linear function                */
  __IOM uint32_t  T5;                           /*!< (@ 0x00000574) End point of 6th piece wise linear function                */
} NRF_TEMP_Type;                                /*!< Size = 1400 (0x578)                                                       */



/* =========================================================================================================================== */
/* ================                                           COMP                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Comparator (COMP)
  */

